###############################################
# Друкує усі літери з рядку, які у верхньому регістрі, у прикладі вище це SFGA

value = input("Plese write here your string: ")

#for i in value:
#    if i.isupper():
#        print(i)

###############################################
# Друкує індекси усіх пробілів, якщо вони є, у прикладі вище це  1, 8

a_letter = " "

for index, letter in enumerate(value):
    if letter == a_letter:
        print(f"{index}, _")

###############################################
# Друкує усі гласні букви з рядка, у прикладі вище це  aAa
pass

###############################################
# Якщо у рядку буде послідовність з трьох цифр, наприклад ab-c474f g - цикл переривається та друкується повідомлення про цю подію. Інакше друкується повідомлення про коректне завершення циклу

pass

###############################################
